Revit 2027 API
PartUtils.GetAssociatedPartMaker(Document, LinkElementId) Method
 Gets associated PartMaker for an element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PartMaker GetAssociatedPartMaker(
	Document hostDocument,
	LinkElementId hostOrLinkElementId
)
Public Shared Function GetAssociatedPartMaker (
	hostDocument As Document,
	hostOrLinkElementId As LinkElementId
) As PartMaker
public:
static PartMaker^ GetAssociatedPartMaker(
	Document^ hostDocument,
	LinkElementId^ hostOrLinkElementId
)
static member GetAssociatedPartMaker :
        hostDocument : Document *
        hostOrLinkElementId : LinkElementId -> PartMaker
Parameters
hostDocument Document
 The document
hostOrLinkElementId LinkElementId
 The id for the element to be checked for associated Parts
Return Value
PartMaker
 The PartMaker element that is making Parts for this element. null if there is no associated PartMaker.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
GetAssociatedPartMaker Overload
Autodesk.Revit.DB Namespace